W4D1/first_routes/app/controllers/artworks_controller.rb

  def index
    #render json: params
    user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]