W4D1/first_routes/app/controllers/users_controller.rb

  def create
    user = User.new(params.require(:user).permit(:name, :email))
    if user.save
---
INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "'Jerimiah'"], ["email", "'bullfrog@gmail.com'"]]

  def update
    user = User.update(params[:id], params.require(:user).permit(:name, :email))
---
UPDATE "users" SET "name" = $1, "email" = $2 WHERE "users"."id" = $3  [["name", "Nick"], ["email", "nick@gmail.com"], ["id", 5]]